/**
 * Алгоритм віршованого шифрування:
 * * 1.	Вибрати вірш для використання в якості ключа шифрування.
 * * 2.	Пронумерувати  всі стовпчики і рядки вибраного ключа шифрування двозначними цифрами: CC SS відповідно.
 * * 3.	Символу M  вхідного повідомлення поставити у відповідність 4-значний код  CС/SS такого ж вибраного випадково символу ключа шифрування. Тут чисельник кожного дробу - номер рядка, а знаменник - номер стовпчика.
 * * 4.	Код CС/SS занести до шифрограми і додати кому.
 * * 5.	Повторити п.п.3-4  для кожного символу повідомлення, що шифрується
 * Алгоритм розшифрування з використанням вірша:
 * * 1.	Для елемента коду CС/SS криптограми визначити  номер стовпчика CС  і рядка SS зашифрованого символу.
 * * 2.	Знайти в ключі шифрування символ, що знаходиться на перетині CС колонки і SS-рядка.
 * * 3.	Записати знайдений символ в якості розшифрованого символу.
 * * 4.	Повторити п.п.1-3 для кожного елементу коду, відокремленого за допомогою ком.
 */

export default function cipherBook(input, poem, dictionary, mode) {
  console.log(mode === 'Encrypt' ? 'encrypting...' : 'decrypting...');
  let lineByLinePoem = separateOnNextLine(poem);
  console.dir(dictionary);
  // let dictionaty = createDictionary()

  // const alength = dictionary.length;
  // const modif = mode === 'Encrypt' ? 1 : -1;

  // Debug
  // console.log({ poem });

  let output = '';
  for (let i = 0; i < input.length; i++) output += input[i];
  return output;
}

const separateOnNextLine = poem => {
  return poem.split('\n').map(line => line + '\n');
};
