let poem = `Летели облака,
Летели далеко,
Как мамина рука,
Как папино трико,

Как рыбы-корабли,
Как мысли дурака,
Над окнами земли
Летели облака.

Летели купола,
Дороги и цветы,
Звоня в колокола
Беспечные, как ты,

Как капли молока,
Как здравствуй и прощай,
Как недопитый чай,
Летели облака.

Летели кирпичи,
Солдаты старых стен,
Драконы перемен,
Богема и бичи.

Не страшная война,
Не горькое вино,
Печальная страна,
А в ней твое окно.

Летели не спеша,
Порхали неглиже,
Как юная душа
В сгоревшей парандже,

В Даос и Вифлеем,
К окраине земли,
От глупых теорем,
Оставленных в пыли.

Зажгу на кухне свет
Из века-сундука,
Где крылья много лет
Искали седока,

Достану, разомну,
Пристрою на спине
И запущу весну,
И облака во мне.`;

export default poem;
